Revit 2027 API
BasicFileInfo.IsCreatedLocal Property
 Checks if the file is local and created by RevitServerTool.exe.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCreatedLocal { get; }
Public ReadOnly Property IsCreatedLocal As Boolean
	Get
public:
property bool IsCreatedLocal {
	bool get ();
}
member IsCreatedLocal : bool with get
Property Value
Boolean
Remarks
 The value will be set to false after the file is saved and IsLocal will become true.
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace